Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector.SetSelectedObjects Method
 Set analysis objects as selected in model views.
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int SetSelectedObjects(
	List<AnalysisObject> analysisObjects,
	bool append
)
Public Function SetSelectedObjects (
	analysisObjects As List(Of AnalysisObject),
	append As Boolean
) As Integer
Parameters
analysisObjects
Type: System.Collections.Generic.List<AnalysisObject>
The analysis objects.
append
Type: System.Boolean
If true, objects are added to currently selected. If false, current selection is cleared.
Return Value
Type: Int32
The count of objects selected.
See Also
Reference
AnalysisObjectSelector Class
Tekla.Structures.Analysis.UI Namespace